package quiz01;

public class Quiz22 {
	public static void main(String[] args) {
		
	 /*
	  * 문제
	  * 1. 두수의 더하기를 맞추는 무제를 지속적으로 출제하는 프로그램입니다.
	  * 2. 2가지의 저수를 1~100사이의 난수를 발생 시켜 지속적으로 문제를 출제한 후 정답이면
	  *  정답 카운트를 +1씩 , 틀리면 오답 카운트를 +1씩 올려주는 프로그ㅜ램을 만드세요
	  *  또 한 이 프로그램은 0 을 입력 받으면 반복을 중단(탈출)합니다
	  *  ex) 27 + 84 = ?
	  */
		
	/*먼저, 정수를 입력받기 위해 Scanner를 써줍시다.
      1. 무한 반복문을 만들어 주세요
      2. 2가지의 난수를 발생시켜 저장 시켜 주세요
      3. 출력을 맞춰 줍니다.
      4. 정수를 입력 받습니다.
      5. 받은 정수가 0인지 검사합니다.
      6. 2가지 정수를 합한 값과 입력받은 정수가 같은지 검사합니다.
      7. 맞다면 정답 카운트를, 틀렸다면 오답 카운트를 올려줍니다.
      8. 0을 입력했다면, 무한 반복문 바깥에서 정답 횟수와 틀린 횟수를 출력해 줍니다.
	 */
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}
}
